app/views/busquedas/_form.html.erb

SELECT "categoria"."name", "categoria"."name" FROM "categoria"
---
    <%= form.label :categoria, style: "display: block" %>
    <%= form.select :categoria, Categorium.pluck(:name, :name), :prompt => "Select One" %>