app/controllers/busquedas_controller.rb

    end

    respond_to do |format|
      if @busqueda.save
---
INSERT INTO "busquedas" ("tipo", "categoria", "texto", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tipo", "category"], ["categoria", "animal"], ["texto", ""], ["email", ""], ["created_at", "2022-06-04 21:48:20.128407"], ["updated_at", "2022-06-04 21:48:20.128407"]]

  def destroy
    @busqueda.destroy
---
DELETE FROM "busquedas" WHERE "busquedas"."id" = ?  [["id", 49]]

    def set_busqueda
      @busqueda = Busqueda.find(params[:id])
---
SELECT "busquedas".* FROM "busquedas" WHERE "busquedas"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]