app/controllers/busquedas_controller.rb

  def index
    @busquedas = Busqueda.all
---
SELECT "busquedas".* FROM "busquedas"

    end

    respond_to do |format|
      if @busqueda.save
---
UPDATE "busquedas" SET "texto" = ?, "updated_at" = ? WHERE "busquedas"."id" = ?  [["texto", "dddddd"], ["updated_at", "2022-06-04 14:59:35.721508"], ["id", 21]]
INSERT INTO "busquedas" ("tipo", "categoria", "texto", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tipo", "category"], ["categoria", "animal"], ["texto", ""], ["email", ""], ["created_at", "2022-06-05 14:36:03.844545"], ["updated_at", "2022-06-05 14:36:03.844545"]]

  def update
    respond_to do |format|
      if @busqueda.update(busqueda_params)
---
UPDATE "busquedas" SET "categoria" = ?, "updated_at" = ? WHERE "busquedas"."id" = ?  [["categoria", "money"], ["updated_at", "2022-06-08 20:50:13.257605"], ["id", 82]]

  def destroy
    @busqueda.destroy
---
DELETE FROM "busquedas" WHERE "busquedas"."id" = ?  [["id", 57]]

    def set_busqueda
      @busqueda = Busqueda.find(params[:id])
---
SELECT "busquedas".* FROM "busquedas" WHERE "busquedas"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]

    def crear_resultado(item)

      @resultado = Resultado.new()

      @resultado.assign_attributes(
        url: item.url,
        value: item.value,
        busqueda_id: @busqueda.id
      )

      if @resultado.save
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."busqueda_id" = ?  [["busqueda_id", 49]]
INSERT INTO "resultados" ("url", "value", "busqueda_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)